package ex_240307;

public class Memo {
//	1. 스포츠 등록하기. 
//	2. 등록된 스포츠 검색해서 출력하기.
//	3. 종료하기(exit) 입력해주세요. 
//
//	1. 스포츠 종목 명 입력해주세요>>:
//	2. 인원수 입력해주세요>>: 
//	3. 플레이 시간 입력해주세요>>: 
//	4. 운동 장소 입력해주세요>>:
//	5. 개막 시즌 입력해주세요>>:
//	6. 실내:1, 실외:2 입력해주세요>>
//	7. 멤버를 입력해주세요>>
//	8. 사용장비를 입력해주세요>>
//
//	0. 시간, 시스템에서 현재 날짜로 대체 
	
	/*
	현재, 작업 현황 보고서. 

	1. 콘솔에서 입력을 받아서, 메모리 상에 저장하고, 
	검색하고, 실행이 되는 프로그램. 

	2. 자바에도 UI(Swing, AWT) 화면구성. 
	(HTML에서 입력 폼 비슷)
	또 똑같이 메모리에 임시 저장하고 검색하고, 실행이 되는 프로그램

	3. 데이터베이스를 연결 (오라클) 연결. 
	화면(스윙) + 저장소(메모리 -> DB) 
	저장하고, 검색하고, 실행이 되는 프로그램. 

	4. 소켓 통신을 이용해서, 외부 디비에 저장이 가능해요.

	--------------------------------------------------
	웹 애플리케이션, JSP 로 시작. 
	1- 3번까지는 기본으로 계속 작업을 하게 될 예정.

	모바일 애플리케이션, 각각 프레임워크에서 작업을 익히기.

*/

}
